app/controllers/sessions_controller.rb

  def create
    login = params[:user][:login]
    password = params[:user][:password]

    user = User.find_by login: login
---
SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT 1  [["login", "nb"]]