app/controllers/todolists_controller.rb

SELECT COUNT(*) FROM "todolists" WHERE "todolists"."user_id" = ?  [["user_id", 61]]
---
  def index
    @todolists = current_user.todolists.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM "todoitems" WHERE "todoitems"."todolist_id" = ?  [["todolist_id", 36]]
---
  def show
    @todoitems = @todolist.todoitems.paginate(page: params[:page], per_page: 5)

INSERT INTO "todolists" ("list_name", "list_due_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["list_name", "French Reconquest"], ["list_due_date", "1821-05-22"], ["user_id", 61], ["created_at", "2015-04-19 16:44:31.608237"], ["updated_at", "2015-04-19 16:44:31.608237"]]
---
  def create
    @todolist = current_user.todolists.new(todolist_params)

    respond_to do |format|
      if @todolist.save

UPDATE "todolists" SET "list_due_date" = ?, "updated_at" = ? WHERE "todolists"."id" = ?  [["list_due_date", "2015-08-07"], ["updated_at", "2015-04-18 23:08:47.216610"], ["id", 21]]
---
  def update
    respond_to do |format|
      if @todolist.update(todolist_params)

DELETE FROM "todolists" WHERE "todolists"."id" = ?  [["id", 21]]
---
  def destroy
    @todolist.destroy