app/controllers/todoitems_controller.rb

INSERT INTO "todoitems" ("task_title", "description", "due_date", "todolist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["task_title", ""], ["description", ""], ["due_date", "2015-04-19"], ["todolist_id", 19], ["created_at", "2015-04-19 20:05:34.418851"], ["updated_at", "2015-04-19 20:05:34.418851"]]
---
  def create
    @todoitem = @todolist.todoitems.new(todoitem_params)
    if @todoitem.save

UPDATE "todoitems" SET "task_title" = ?, "updated_at" = ? WHERE "todoitems"."id" = ?  [["task_title", "Russian rivers survey - a super long title to really see how far it can go: xxxxxxxxx10xxxxxxxxx20xxxxxxxxxx30"], ["updated_at", "2015-05-03 20:16:29.768783"], ["id", 162]]
---
  def update
    @todoitem = @todolist.todoitems.find(params[:id])
    if @todoitem.update(todoitem_params)

UPDATE "todoitems" SET "done" = ?, "updated_at" = ? WHERE "todoitems"."id" = ?  [["done", "t"], ["updated_at", "2015-05-03 02:55:38.750267"], ["id", 164]]
---
  def update_done
    logger.info("This should be valid: #{params[:todoitem_id]}")
    #logger.info("This should be true: #{@todolist_id}")
    @todoitem = Todoitem.find(params[:todoitem_id])
    @todoitem.done = true
    #logger.info("This should be true: #{@todoitem.task}")
    @todoitem.save

DELETE FROM "tags_todoitems" WHERE "tags_todoitems"."todoitem_id" = ?  [["todoitem_id", 48]]
DELETE FROM "todoitems" WHERE "todoitems"."id" = ?  [["id", 48]]
---
  def destroy
    @todoitem = @todolist.todoitems.find(params[:id])
    @todoitem.destroy